create extension if not exists postgis;

CREATE TABLE if not exists buildings (
	ogc_fid serial4 NOT NULL,
	geom public.geometry(multipolygon, 4326) NULL,
	"timestamp" timestamptz NULL,
	"version" varchar NULL,
	changeset varchar NULL,
	"user" varchar NULL,
	uid varchar NULL,
	"addr:city" varchar NULL,
	"addr:housenumber" varchar NULL,
	"addr:place" varchar NULL,
	"addr:postcode" varchar NULL,
	building varchar NULL,
	"building:levels" varchar NULL,
	id varchar NULL,
	CONSTRAINT buildings_pkey PRIMARY KEY (ogc_fid)
);
CREATE INDEX if not exists buildings_geom_geom_idx ON buildings USING gist (geom);

INSERT INTO buildings (geom,"timestamp","version",changeset,"user",uid,"addr:city","addr:housenumber","addr:place","addr:postcode",building,"building:levels",id) VALUES
	 ('SRID=4326;MULTIPOLYGON (((49.8420578 53.473555, 49.8420586 53.4734733, 49.8421472 53.4734736, 49.8421464 53.4735553, 49.8420578 53.473555)))'::public.geometry,'2025-10-20 00:45:40.000','1','173510023','Ozon OSM15','23041867',NULL,NULL,NULL,NULL,'yes',NULL,'way/1443335827'),
	 ('SRID=4326;MULTIPOLYGON (((49.8430626 53.4735484, 49.8430595 53.4734879, 49.8431457 53.4734863, 49.8431488 53.4735469, 49.8430626 53.4735484)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','664','СНТ Жигули','443902','house','1','way/1486898603'),
	 ('SRID=4326;MULTIPOLYGON (((49.8436671 53.4736879, 49.8436649 53.4737229, 49.8435958 53.4737213, 49.843598 53.4736863, 49.8436671 53.4736879)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','662','СНТ Жигули','443902','house','1','way/1486898604'),
	 ('SRID=4326;MULTIPOLYGON (((49.843094 53.4739128, 49.8430908 53.4738723, 49.8431775 53.4738698, 49.8431766 53.4738583, 49.843238 53.4738565, 49.8432421 53.4739086, 49.843094 53.4739128)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','637','СНТ Жигули','443902','house','1','way/1486898605'),
	 ('SRID=4326;MULTIPOLYGON (((49.842823 53.4739602, 49.8428186 53.4738996, 49.8429045 53.4738974, 49.8429088 53.4739579, 49.842823 53.4739602)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','636','СНТ Жигули','443902','house','1','way/1486898606'),
	 ('SRID=4326;MULTIPOLYGON (((49.8425583 53.4739488, 49.842553 53.4738853, 49.842704 53.4738809, 49.8427092 53.4739444, 49.8425583 53.4739488)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','635','СНТ Жигули','443902','house','1','way/1486898607'),
	 ('SRID=4326;MULTIPOLYGON (((49.8423432 53.4735447, 49.8423394 53.4734864, 49.8424381 53.4734841, 49.8424419 53.4735424, 49.8423432 53.4735447)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','665','СНТ Жигули','443902','house','1','way/1486898608'),
	 ('SRID=4326;MULTIPOLYGON (((49.8416966 53.4735709, 49.8416937 53.4735063, 49.841759 53.4735052, 49.8417619 53.4735699, 49.8416966 53.4735709)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','668','СНТ Жигули','443902','house','1','way/1486898609'),
	 ('SRID=4326;MULTIPOLYGON (((49.8414845 53.4735093, 49.8414871 53.473555, 49.8415344 53.4735541, 49.8415359 53.4735798, 49.8414178 53.4735822, 49.8414138 53.4735108, 49.8414845 53.4735093)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','669','СНТ Жигули','443902','house','1','way/1486898610'),
	 ('SRID=4326;MULTIPOLYGON (((49.8414825 53.4740116, 49.8414763 53.4739418, 49.841549 53.4739395, 49.8415553 53.4740093, 49.8414825 53.4740116)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','631','СНТ Жигули','443902','house','1','way/1486898611'),
	 ('SRID=4326;MULTIPOLYGON (((49.8432224 53.4735355, 49.843221 53.4734726, 49.843313 53.4734719, 49.8433143 53.4735348, 49.8432224 53.4735355)))'::public.geometry,'2026-03-09 20:22:31.000','1','179593449','dedrowe','23918697','Самара','663','СНТ Жигули','443902','house','1','way/1486898612');
